package ch14.test2;

public class TaxDriver {
	// 근로소득자와 사업소득자의 세금을 계산한다
	public static void main(String[] args) {
		// 이름이 ‘선남’이고 번호가 100이고 월급이 3,000,000인
		// SalaryTaxPayer 객체를 생성하고 payer1이 가리키게 한다
		// 여기에 코드를 입력하세요

		// payer1의 모든 데이터를 출력한다
		// 여기에 코드를 입력하세요

		// payer1의 세금을 계산하여 출력한다
		// 여기에 코드를 입력하세요

		// 이름이 ‘선녀’이고 번호가 200이고 총매출액이 120,000,00이고
		// 총비용이 75,000,000인 BusinessTaxPayer 객체를 생성하고 payer2가 가리키게 한다
		// 여기에 코드를 입력하세요

		// payer2의 모든 데이터를 출력한다
		// 여기에 코드를 입력하세요

		// payer2의 세금을 계산하여 출력한다
		// 여기에 코드를 입력하세요
	}
}